{
  "reviews": [
    {
      "reviewId": "r01",
      "movieName": "Piku",
      "director": "Shoojit Sircar",
      "author": "Nandakishor M Pai",
      "year": 2015,
      "reviewText": "PIKU will remain a special film for me because it handles an undefined yet nuanced relationship between two characters who understand each other very well. The way this sweet thing builds between Irrfan’s character Rana and Deepika’s character Piku is fascinating and they keep conversing about the idea of marriage, roots, companionship and it somewhere gave the glimpse of Before Sunrise. Very rarely I have seen Indian movies that let relationships stay in a complicated yet beautiful space without jumping to commitments or forced closures. Piku does that and it’s a beauty to watch two people who respect each other’s boundaries, space and are independent at the same time. They respect and value each other's presence. The last scene of Piku where they play badminton is a work of art as we see Irrfan's character, Rana is not inside the house. He is outside, maybe there is no space inside Piku’s house or maybe it’s that he wishes to stay there only. Yet they are involved in the activity of exchanging conversations, ideas, and all through a game of badminton that acts as a beautiful symbol. It sums up their relationship neatly. Both of them are okay with this idea of setting clear boundaries (literally in the game of badminton) and wishing to stay there and keep going without the need of breaking anything. If he comes to her side, poetically the game stops, and nothing's left to do. She wishes to keep the relationship that way where there are differences of opinions, explorable conversations, and all this is left for us to think as the scene ends with a ‘Directed by Shoojit Sircar’ loads in and that makes PIKU magnificent."
    },
    {
      "reviewId": "r02",
      "movieName": "Moonrise kingdom",
      "director": "Wes Anderson",
      "author": "Hilan S Siva",
      "year": 2012,
      "reviewText": "No matter how old we get, there's always a 12-year old kid inside all of us. Who wants to run away from the duties and responsibilities. Moonrise Kingdom directed by Wes Anderson is a coming-of-age comedy-drama which could make us that 12-year old. This movie is about Sam, a 12-year old orphan, who falls in love with Suzy who both run away to an island which will lead an entire town to begin a search. What I found the most interesting part in a Wes Anderson movie is that the adults in his movies act like children and the children act as adults. It's very interesting to see this irony, which would lead to humorous adventures of Sam and Suzy. All the characters in this movie has their own \"ironical\" characteristics. They have their problems but the way they manage that is just like children, but the character which I liked most was Edward Norton's Scout Master Ward, his portions was hilarious. In this move the style meets the screenplay, the tone and the setting of the movie is just like the fairy tales that Suzy reads. when we are introduced to different characters they are all doing their normal routine before getting dropped into the movie.\nWes Anderson uses more planar camera movements which keeps reminding that we are watching a movie, or more like we are watching a drama. Movies are always an art to entertain, in my opinion the best art since it's the combination of so many arts. The director also used many references in this movie like the iconic blood shed scene in Stanley Kubrick's 'The Shining' (1980) and the dance scene from Quentin Tarantino's 'Pulp Fiction' (1994) which was inspired from Jean-Luc Godard's French movie 'band of outsiders' (1964). All movies are inspired form another movies one way or another, but their will be change I the way of conveying it to the audiences from generation to generation. Moonrise Kingdom will be a treat to an Wes Anderson fan because of it's style, color gradings, and if doesn't like his style; come on who wouldn't like a comedy/romance movie which takes us to an adventure along with the Sam and Suzy. Believe me it's going to be worth a watch."
    },
    {
      "reviewId": "r03",
      "movieName": "Cinema Paradiso",
      "director": "Giuseppe Tornatore",
      "year": 1988,
      "author": "Jacob Koshy",
      "reviewText": "\"Life isn't like in the movies. Life is much harder.\"\n'Cinema Paradiso', the movie which got stuck in my mind months before watching it. The image of a boy gazing at the theatre screen with enthusiasm, is still in my mind.\nThis movie is about the friendship between Salvatore and Alfredo. Salvatore is a famous film director, he returns to his hometown for the funeral of the local theatre's film projectionist Alfredo. The news of Alfredo's death takes him back to his memory of his life as a young boy falling in love with movies and how Alfredo had influenced him.\nThe first thing you'll miss after watching this movie will be the crowded theatres. Different people watching a movie in the same space. The feel, the ambiance, the cheering, the joy, The despair, all this can be experienced at its peak in the theatres. This was the first Italian movie that I watched,the feel this movie could give is not less than other movies. Movies influence people in many ways. Movies have the power to transport us from the time of prehistoric hunters and gatherers to futurestics space travellers. \nThe excitement in Toto's (Salvatore's) eyes reflects ourselves. Whether a movie is good or bad, it still has something which we can take with us. 'Cinema Paradiso' is a movie about life, love, friendship, moreover it's about MOVIES. Thank you Giuseppe Tornatore for giving this love letter to cinema. Unfortunately I haven't watched Tornatore's other movies so I can't explain his direction, techniques and all, but this movie should be his masterpiece. It can make us travel through the mind of Salvatore : make us happy when he is happy, make us sad when he is sad, In the end this is what a movie should do. Feeling connections towards the characters is what makes a movie memorable. Considering that, this movie could stay in your memories forever."
    },
    {
      "reviewId": "r04",
      "movieName": "CODA",
      "director": "Sian Heder",
      "author": "Hilan S Siva",
      "year": 2021,
      "reviewText": "CODA tells us the story of Ruby, who is the only hearing member of a deaf family, how she discovers her passion and pursues it. This movie is like a warm hug, which we all need at a certain point of our life. Ruby always felt inferior to the other children because of her family. Everyone in this movie had done their role perfectly, the one who stood out was Ruby's father (Troy Kotsur) but my favorite character was Ruby's brother, I could connect with that person at some point. And Ruby's choir teacher, how could I miss him. The movie is mostly told from the view of Ruby, that's why I told everyone as connected to her. But the screenplay is so good that it allows us to feel the emotions of every character who comes in this movie. This movie beautifully conveys the love shared by the members of the family, trying to be there for each other. I would say this movie is like a beautiful melody which could fill our hearts with happiness. Moreover I know how it feels to be the different member in the family, So for me it's the best feel good movie I had seen recently. Some movies have this magic with them, that they could remind us of a small thing........ That is who we are.....  HUMANS!\nI hope most of you may have watched this movie. If not, try to watch. Hope you'll like it.  "
    },
    {
      "reviewId": "r05",
      "movieName": "A Silent Voice",
      "director": "Naoko Yamada",
      "author": "Chris Godfrey",
      "year": 2016,
      "reviewText": "A Silent Voice\nA well known film that I believe should be a must-see for everyone not because it's beautiful but because it stresses on certain things about life that are very real in today's world. You may not like it but you can never hate it.\nThe movie begins with Shoya Ishida attempting to commit suicide over his actions during his childhood days before being confronted by his mother on the matter. Shouko Nishimiya, a classmate of Shoya during her childhood days, faced a disability of being unable to hear. Despite all of her attempts to become friends with him, he continues to bully her which eventually leads to her leaving the school. Shoya then slowly becomes ostracised from his group.\nLater on, Shoya meets her during high-school as a person who reflected on his actions. He believed his actions could not go unpunished. Despite that. Shoya decides to become friends with Shouko, learning to use the sign-language at the same time. The movie stresses on the fact that Shoya could not look at anyone's face with the \"x's\" in their faces as he could not forgive himself. Shouko was the kind of person who wanted to be amicable with everyone and would do anything. However, she believes it's her fault that things never go as planned and that she sees herself as being worthless, being a burden leading to repeated thoughts of dying.\nThe movie along with the soundtrack perfectly captures the moments as they forgive themselves and each other, and the focus on other characters becoming better versions of themselves. What I really liked was the many ways in which the movie tells us how to pay attention to each other's voices and to forgive oneself, to realize that everyone has a place in this world and that you are loved. The transformation of the character that was once a bully to a person who acknowledges what they've done and what they do to make up for it is what I believe makes for the beauty behind this film."
    },
    {
      "reviewId": "r06",
      "movieName": "Submarine",
      "director": "Richard Ayoade",
      "author": "Karthik Jayaram",
      "year": 2010,
      "reviewText": "To talk about the movie submarine is to talk about how refreshing your morning coffee tastes or the feeling you get when you are cozying up inside home with heavy rain pattering outside ur room, the silenced chucks of raindrops making your feel all safe inside ur tiny dwelling. Those tiny nuances of your emotions that you remember long after they have disappeared from your mind, the first hint of that long forgotten memory , that sums up to me the experience of submarine.\nBroadly speaking , submarine is a coming to age story of Oliver Tate, a rather confused adolescent , figuring and reasoning out his life experiences. A film style I have always loved , the self-narrative style, where the protagonist of the movie is the narrator itself, a very first person-ish feeling to a movie, a famous narrative trope that cult classcis such as Fight club (1998) also heavily incorporates.\nFrom enjoying being a lonely masquerade which apparently gives him time to think to monitoring his parents sexual patterns in order to save their marriage, Oliver shows us the things he has to do to give reasoning to his existence and everything around him. One very thought which Oliver goes deep into is  that , the only way he gets through life , is to imagine himself in an entirely disconnected reality. No, Oliver does not have an acid trip in the movie , but he explains how he often contemplates what would happen if he was suddenly dead. The funeral where his friends would tell that they missed him , his parents and teachers coming with hidden praises and sorrow everywhere. Oliver tate's death becomes an awakening for the people about the type of person he was, and people all around stand in regret , hoping to feel his energy for one last time. These deep internal imagiantions are a huge characteristic of the movie , the blissful day dreams that all of us fantasize about, not in the hope that they come true, but just as a way fo escape from the cold blooded logical nature of reality. \nThe first part of the movie deals with his love interest Jordana(an intimidating person acc. to Oliver)  and how he becomes her boyfried because of a series of events which involved in her blackmailing him. The rumours spread across the school and Oliver gets bullied , but stands up when the bully forces him to abuse Jordana , which piques her intrest in Oliver and they end up being in relationship. The following parts of the movie are shot in a way you would rememeber a relationship in the most nostlagic way possible.\nWith alex turner , the artic monkeys lead vocialist stepping in with his guitar poems, adding the teenage romantic aesthetic into the picture. The cinematography also is very unique, with the shots being similar to that shot in the  1980s ; with the color toned down and slightly  grainy and seems like it was shown straight out a film roll. The rather unusual bonding between two behavarioual extremes of Oliver and Jordana is a huge part of what makes the movie so beautiful, big old bully Jordana slightly but hesitantly showing her soft side to Oliver and him embracing those experiences slightly confused but still enjoying the moment nevertheless.\nThe mental adventures of Oliver Tate doesnt stop there. It seems he loves his family but details to us about the incompatibilities between his parents that he is afraid might split them apart. The second part of movie is about him  desperately trying to save his parents marriage by constantly monitoring his parents voicecalls a, routine checkup of his parents bedroom etc etc . The encounters following this in a way goes deeper into the personality of Oliver.\nThough the movie is primarily narrated by oliver , we get snippets at some parts of the movie which are left unexplained by him, a different angle with which the movie goes deeper into the character of Oliver. The movie ends in a final showdown  where Oliver has to make some serious life decisons as his relationship with Jordana enters new territory and hope of his paretns being happy together seems grimmer than ever.\nThe movie is set in a seaside town in Wales, Great Britian and the setting of the town adds a unique effect to the world building in the movie. The numerous hills in the periphery, the dull and gloomy mornings, the long sunsets ,the dark sky characteristic of that before rain ensues etcetc.; the weather perfect for sitting inside a home and drinking a hot cup of coffee.\nMost the the actors also perfectly execute the typical welsh accents first noticed in the way Oliver tate's class teacher speaks and also subsequently in the cuss rich sentences that his friends tell when advising him about his relationship.\nThe accents are not very much seen in Oliver and his family which hints at them not being from a Welsh setting but nothing in the movie gives evidence of that. Jordana also doesnt really have a deep accent but it is noticeable during a few conversations in the film later on.\nWhat captured my attention most is the constant feeling of serious triviality in the movie. The scenes may be something really silly or quite normal, but the whole setting of the frame , the music, the camera angle , the scenes all focus on the serious deep feeling that Oliver is going at that moment. In a  deeper sense it shows how although teenagers have pretty trivial problems compared to those of adults , the feeling that they go through is serious nevertheless.\nEven oliver seems to be aware of this at a few parts of the movie saying,\"these things that I'm doing right now might feel funny while my 38\" .\nThe music by Alex Turner is probably the reason why i loved the movie in the first place. I had heard the Submarine album a year before watching the movie and the songs Piledriver waltz and stuck in the puzzle still remain close to my musical being. That emotional setting provided by the songs help me vibe with the movie at first watch itself and I have at times contemplated whether i would have even liked the movie in the first place if I hadnt listended to those songs before.\n In summary it might seem like a cliche  rom-com  where a boy lands a girl and he saves his parents marriage and everything ends happily . But to me , the film is more than that. Its shows me how beatiful of an experience growing up is, realizing that those tiny emotions that are part of maturing up and being part of some pretty questionable stuff , the kinda stuff u remember when ur 38.\nTo me it shows how life is an experience in itself, no talents , no big events nothing.\nThe simple act of living and experiencing those nuances of life has a bigger meaning to it, because those are the  things that decorate our life till we part with the world and we should cherish them always."
    },
    {
      "reviewId": "r07",
      "movieName": "Ajagajantharam",
      "director": "Tinu Pappachan",
      "author": "Nandakishor M Pai",
      "year": 2021,
      "reviewText": "Kala but with fewer politics and more men injected with testosterone. That might sound like a negative, but it’s not if you are in for a treat on the screen instead of a life-changing movie that makes you contemplate the social structure. In fact, there is no structure to anything in the movie that makes the events work like a charm. It almost felt like I bought tickets to a pooram and the ambiance created is praise-worthy. Lately, the emergence of a type of cinema where the story is kept last in the queue giving priority to sound, camera, and the ambiance it brings out is a refreshment over the templates of carelessly designed frames running towards the moral compass to give the protagonist a platform to show off kindness. In fact, there is no protagonist here even though the film travels through a particular character, everyone is flawed to the extent you even doubt if they were there when evolution was taking place. \nFights are choreographed by testosterone and this is not the usual one person fighting 5 people with their 2 hands. This is 5 people fighting god knows whom all with everything extending from their body. Music works like that provocative person who screws you into a fight. Characters are not defined through backstory or gestures. But through decisions and frames. A character walks through a dirt pit of just 1 meter even though there is a way nearby to avoid the same. These small details make this ride more immersive and exhilarating. Motives are childish which might come off as jarring, but works for the characters looking for some testosterone outlets.\nIt's quite debatable how some frames project toxic masculinity or are they raw portrayals of a chaotic society? The movie has characters who remind the beasts of the consequences, but that will take place after you see ‘the end’, so the consequences, damages, injuries, and sheer bloodshed is none of your concern. That fact adds a meta-layer questioning whether I subscribed to see people fight to the death? I don’t know. This film is still nowhere near being a masterpiece as there are a lot of departments where the film fails including acting, written humor, etc. But am I really expecting a character to exhibit layered emotional conflicts after a fight or do I just want to see him fight back? The elephant deserves a huge part of this success and I was blown by the sheer courage and effort put into making the animal be one. The stunts in this film are captured and presented in a way that your eyeballs are trying to witness the best punches from the multiple ones on the screen every second. Every song is rooted in the place and the people. This film ends up using all the facilities a theatre can provide and it’s really admirable how effectively modern sound systems are used to create a festive environment. There are parts where the film is sloppy, but it’s a rollercoaster that ends in a very high note of escapism."
    },
    {
      "reviewId": "r08",
      "movieName": "Spiderman - No way home",
      "director": "Jon Watts",
      "author": "Nandakishor M Pai",
      "year": 2021,
      "reviewText": "Rarely do you see a movie and it turns out to be exactly what you expected and still, you are aw struck by seeing the MARVEL. Spiderman no way home is an all in all fan servicing movie wrapped with a good story that perfectly defines what spiderman stands for. Creators know the audience more than the characters and it led them to write a fairly simple story that kept me focused on the magic around it. Pacing is something that stands out with a fairly calm first-half pace followed by a stormy second half. The nuance with villains are handled in the movie is something that will go down in the history as remarkable.\nOne of the major reasons why this film stands out is because of the thin line through which it walked without falling into money-grabbing opportunity and blind fan servicing. References are strong and rewarding for the people who invested their childhood in this web shooter(s). Visuals are far beyond engaging and surprising at this point tbh. Fight sequences are neatly combined with dialogues that exponentially increased the humor, excitement, and engagement. The vision of VFX artists involved is something to be appreciated. Combining web and magic and bringing out aesthetic fights kept the theaters roaring. As someone rightly pointed out in a review, this is a pop culture event more than a film.\nTom holland communicated emotions very well which was the difficult part to pull off. The self-awareness of the characters and the film as a whole bridge the gap from the audience. Coming to the 3D experience, yes, it is not just a gimmick and I genuinely felt the visuals as more alive and happening with the glasses so kudos to that. I have tried my best to keep this as a spoiler-free review and the hype around the movie is perfectly justified by the work with full sincerity and respect for the fans."
    },
    {
      "reviewId": "r09",
      "movieName": "After Life",
      "director": "Hirokazu Kore-Eda",
      "author": "Thapan Amarnath",
      "year": 1998,
      "reviewText": "I've always been fascinated by the concept of death and After Life provides an out of the box and interesting approach to what happens after death. After Life presents the conflicts and confusions of different age groups and how they interpret life. The use of lighting in the scene where the gateway opens makes it whimsical. The gentleness of Japanese etiquette is evident from every conversations in the film. 'After life' is not a movie revered for it's technicality, not that it's not a fine piece of filmmaking but it's remembered for the question it puts forth which makes you think about the movie on odd times and quiet days, alone in your room.\nReliving a single memory for an eternity seems to be better than heaven or hell, because you have the right to choose. It gives an opportunity to relieve people of their sins, regrets, failures and despairs. Everyone can be happy, even if we clearly don't deserve it. It's like nature is forgiving us.\nI feel like I'm in the after life as per the movie because even if I'm making new memories everyday, I revisit and cling on to certain things in the past. They give me a reason to continue. Maybe we all do the same. Or maybe life itself is the after life. Does that make sense? But does everything have to?"
    },
    {
      "reviewId": "r10",
      "movieName": "Silenced",
      "director": "Hwang Dong-Hyuk",
      "author": "Rohith Chivukula",
      "year": 2011,
      "reviewText": "This movie was not easy for me to sit through. There is a lot of graphic content present. The movie makes the viewer extremely uncomfortable and angry. It made the country of South Korea so livid they had to reopen the original case the movie is based on, the events having taken place six years before it was released. Silenced was so impactful the National Assembly of South Korea passed a bill called the Dogani Bill, Dogani being the Korean name of the movie, to abolish the statute of limitations for sexual offences against minors and the disabled.\nWith all this, it is safe to say that director Hwang Dong-hyuk, who also made the hit Netflix show Squid Game, has handled the movie matter very well.\nThe movie shows how difficult it is to accuse people in power of abuse, as they will do everything in their power to get away with as little \"punishment\" as possible. To make matters worse, the victims, the children, are deaf and mute, and are without functioning families. They have nobody to turn to in the time of need. They cannot even speak out against the atrocities committed against them, and need a voice to support them. However, financial and political power can easily evade the myth of justice. When the people fighting for the children try to register complaints against the management, different departments of the government shuttle the complaints back and forth until it becomes redundant. It is not until it is thrown or forced into the public eye that someone is pressured into taking action.\nEven then, the headmaster and the teachers, who are the offenders, can use their influence to get the best possible legal help, and maybe even guarantee favourable judgements from the presiding judge before the case has begun. Their influence blinds people around them, who will defend them no matter what, because they promise money. Religious institutions always back those in power, and it is no surprise that they do so here as well, despite the nature of allegations against them.\nThe victims lose far more trying to get justice for the damage caused, as they are in a position where they can be bought off very easily, even if they do not consent to it\nThe movie exposes the flaws in the judicial system and does an honest portrayal of the way society responds to cases of sexual assault. More questions are piled upon the victims than the accused, and the trauma caused by the public outlash often scares victims into silence. While \"Innocent until proven guilty\" is the norm, the reality is far murkier. We cannot conclude whether the accused is innocent or guilty, but what we can do is not traumatise the victim. We as a society need to be more understanding of the nature of such crimes\nThis is an extremely sensitive topic, and movies like this that know to tread carefully and treat the matter well, are in my opinion educational. I believe they open people's eyes to the atrocities happening in broad daylight that go unpunished, and help them understand matters like this better. It was very hard for me to try to write about this and I hope I've done justice to the movie."
    },
    {
      "reviewId": "r11",
      "movieName": "Midnight Mass",
      "director": "Mike Flanagan",
      "author": "Avaneeth Vinod",
      "year": 2021,
      "reviewText": "The modern Hollywood Horror has largely been defined by Stephen King stories and while most directors adapt his oevure solely extracting his trademark dark aesthetics, only a handful of filmmakers have truly understood the morality play of his works; Mike Flanagan being one of them. And Midnight Mass, his latest original mini series, may be his most loving tribute to the horror master.\nRevealing anything more than a brief synopsis to this ambitiously mounted show is blasphemy, so let me tread very carefully. But this is a miniseries that demands that leap of faith, embracing the laid-back approach of Stephen King, settling us into the monotonous existence of the isolated Catholic community of the fictional Crockett Island. Their world is on a verge of collapse and yet thet live in a habitual sense of denial of impending displacement with the feeling of togetherness only visible in their obligation to attend Mass. In comes Paul Hill, a temporary replacement to their old, dying priest Monsignor Pruitt who claims that their beloved Father was hospitalized while on his way to Damascus. The information is taken as it is. Hamish Linklater is such a perfect casting for Paul as he plays him with this air of deceiving sincerity and warmth. And even when he becomes the catalyst to the terrible supernatural events, you're almost convinced that this would end....well.\nWhat's surprising about Midnight Mass is that despite all the ingredients for a full blown freak fest, Flanagan opts for a more sombre, contemplative slow burn horror. This is a  talky, and I mean EXTREMELY talky show. But it makes sense, as the characters live in that perpetual state of limbo, haplessly attempting to find comfort in their faith, convincing themselves and each other that there is light at the end of the tunnel. So when the \"supernatural\" invades, they take it as the end of the tunnel. Flanagan carefully dissects this power of faith, its ability to heal or destroy based on how you 'read the holy text'. It's close to what Stephen King did in the devastating 'The Mist'.\nBut Flanagan's adherence to the measured pacing means that he is subject to some of the worst inclinations of King's books. For one, the bloated length is a downer. The prolonged monologues is thoughtfully written and wonderully performed but there are often points where I was just waiting for the cut. Flanagan is a master craftsman and he visualizes some truly unsettling moments, but when you sprinkle in sequences that demand relentless tension and hectic movement and you substitute that for tedious philosophical musings, it ventures dangerously close to unintentional comedy.\nWhich doesn't negate the fact that Midnight Mass is captivating, heart wrenching television. The writing may not be as playful with episode structure as it was with The Haunting Of Hill House, but it balances the powerful themes and creep factor pretty well. But the shining armour of the show is its antagonist Beverly Keane, played to terrifying perfection by Samantha Sloyan. A zealous member of the church, Bev Keane is the human form of the cursed island itself - draining islanders of their own free will and conscience. Bev becomes the crucial focal point to the show's spiritual debate and as much as you hate her for the destructive reinterpretations of her religion, you see the tragedy of her existence, the undying need to be the \"saviour\" of her people. But isn't that what religious fanaticism is all about...."
    },
    {
      "reviewId": "r12",
      "movieName": "Joji",
      "director": "Dileesh Pothan",
      "author": "Nandakishor M Pai",
      "year": 2021,
      "reviewText": "JOJI: Challenging Death\nIf death makes a movie dark, JOJI is the black hole. You keep roaming round and round coming across death as a possibility, reality, and even as a decision. “Macbeth” is not forced into the film, instead the film melts into the great work. Music serves as the gateway drug towards this Blue Meth of Dileesh Pothan. People act to behave normally and normal people act in situations to justify their deeds. Writing organically fits into the world we all know and it never craves for Hard and Smart words for communicating the worst. JOJI makes us question the fragility of life and fate. Masculinity is something that this move discusses without a preach. Film is never poetic, not even when it ends, instead it is so raw and simple. Drama in the movie is ironically a drama in most scenes. The film is subtle and eccentric at times. Some dialogues in the movie are here to stay, to be remembered on how to write intentions and motives beyond words. The quote from ‘Being Cyrus’ that every happy family is same where as every unhappy family is different in its own way reflects perfectly here with the novelty with which family relations are handled, expressed and given a closure. I don’t want to waste another paragraph praising the actors as world-class performances have become the minimum for what it takes to be a Malayalam movie in these days and yes I am proud to witness this Parasite without struggling between subtitles and scenes.⁣"
    },
    {
      "reviewId": "r13",
      "movieName": "AK vs AK",
      "director": "Vikramaditya Motwane",
      "author": "Nandakishor M Pai",
      "year": 2020,
      "reviewText": "This is a film on a film being made on a film being made. Yes, it is confusing and bizarre in terms of idea but somewhere it sounds so interesting. Vikramaditya Motwane, one of the few directors in India who plans things very well and excels in execution like in Bhavesh Joshi. I will try my best to not at all give any spoilers so that you can peacefully enjoy the madness.\nThe movie opens with a premise of Anurag having this idea of making a film with Anil Kapoor and how they start filming it. I won’t get much into the story as each giveaway will destroy a layer Motwane created so skillfully. Film has this unique feature of making us suspect it as a film in some frames and as a documentary in others. We all know the madness Anurag takes with him as an aura in his life that makes him the best spontaneous director of India, but this film challenges that and takes it to a whole new dimension.\nThis film has certain parts which stand out as so brilliant that I can't help but just admit that this is the best film of this year. Film keeps you at the edge of the seat in guessing which story is fake and which is the film that we are watching, is it the one Anurag is directing or the one Motwane is. Indian films have struggled a lot in making convoluted stories and some gems that I can remember are Andhadhun, Kaun(1999), Agent Sai Sreenivasa, and Vikram Vedha. There are more convoluted narratives like the Race franchise, but most of them fail in keeping control of the convolution and not falling prey to the same. This film is so strong in holding to the creation that characters get confused in the narrative, but not the audience which is so rare.\nI have always been a fan of films about films like Luck by Chance and Bombay Talkies. Ak vs Ak is brilliant because of the awareness it has as a film about itself. Kashyap and Kapoor instead of manipulating the audience by whitewashing their personality through this medium like other biopics do, Gives the writer and director full liberty to use the worst of both these big shots in India who stay at extremes of art and industry. There is this line that Kapoor says to Kashyap that you should have been in some asylum instead of this industry and Kashyap replies that he is in the correct place. Anurag Kashyap gives the best performance in this film as he surprises with these natural psychotic reactions to the behavior of Kapoor. Anurag reminds Kapoor that this is his comeback film in the film itself. Anil Kapoor does a praiseworthy job and the cameos in this film brings life to this dead end game between the AK’s. ⁣\nAbout the music, All of them are real bangers and suit perfectly the scenes and mental breakdowns the character goes through and I was so moved by the lyrics that the end credit song will make you sit till it ends. I am so happy to be born in this generation where artists get together to make a gem like this by sacrificing their so-called standards/preferences. Motwane and Anurag together have this creative blast that every time they collab we get to celebrate the work. With the ending being average compared to the narrative it followed still managing to end the convolution decently. I wish more such films release where the camera is not a device and the actor is not a superhero."
    },
    {
      "reviewId": "r14",
      "movieName": "An Engineered Dream",
      "director": "Hemant Gaba",
      "author": "Nandana Sony",
      "year": 2018,
      "reviewText": "If just one or two things in our lives were different, it would be us instead of the chosen four and that is the beauty of An Engineered Dream.Poignant and thought-inducing, this documentary is not talking about the big bad wolf that is Kota.Kota has always been that wish-fulfilling factory, maybe not for all, but for a very reasonable number.It’s a sacrifice you take for yourself, ‘yourself’ being the keyword and we can overlook the fact that Kota brings dreams into realisation in what ever extreme way it can, but only if that dream is ours and not ‘engineered’.\nThe documentary straddles a fine line between the heavy underlying themes of passed down dreams & encumbering expectations, and the comic relief provided by the children themselves.The way it weaves through the lives of these children is nothing short of fascinating.We find ourselves growing increasingly invested in the lives of these students and can’t help but root for them.This might be due to the fact that we find a little bit of ourselves in each child in one way or another.The dichotomy of desperately wanting to go home but ignoring your parents once they visit you is something so charecteristic of adolescence and the exam-day jitters are eerily familiar.The creative shenanigans that arise, sorry let me paraphrase, that only arise when we sit down to study, the human nature of compassion to those around you despite the highly competitive environment, all hit way too close to home.\nThe documentary is a blast into the past for all engineering aspirants, regardless of their coaching situations.Hopefully it is an eye-opener for the rest, a window into the lives of these students riddled by insecurities, stress and what not, and a reminder to not fuel these feelings further by snide remarks and false concerns.If just one or two things in our lives were different, it would be us instead of the chosen four and that is the beauty of An Engineered Dream.Poignant and thought-inducing, this documentary is not talking about the big bad wolf that is Kota.Kota has always been that wish-fulfilling factory, maybe not for all, but for a very reasonable number.It’s a sacrifice you take for yourself, ‘yourself’ being the keyword and we can overlook the fact that Kota brings dreams into realisation in what ever extreme way it can, but only if that dream is ours and not ‘engineered’.\nThe documentary straddles a fine line between the heavy underlying themes of passed down dreams & encumbering expectations, and the comic relief provided by the children themselves.The way it weaves through the lives of these children is nothing short of fascinating.We find ourselves growing increasingly invested in the lives of these students and can’t help but root for them.This might be due to the fact that we find a little bit of ourselves in each child in one way or another.The dichotomy of desperately wanting to go home but ignoring your parents once they visit you is something so charecteristic of adolescence and the exam-day jitters are eerily familiar.The creative shenanigans that arise, sorry let me paraphrase, that only arise when we sit down to study, the human nature of compassion to those around you despite the highly competitive environment, all hit way too close to home.\nThe documentary is a blast into the past for all engineering aspirants, regardless of their coaching situations.Hopefully it is an eye-opener for the rest, a window into the lives of these students riddled by insecurities, stress and what not, and a reminder to not fuel these feelings further by snide remarks and false concerns."
    },
    {
      "reviewId": "r15",
      "movieName": "The Florida Project",
      "director": "Sean Baker",
      "author": "Antony S John",
      "year": 2017,
      "reviewText": "\"Do you know why this is my favorite tree? Because it's tipped over, but still growing.\"\nAt a glance, The Florida Project is about the little things. It is about people existing for and amongst the most mundane and superficial pleasures you can find in the city (for a reasonable price). But you should also know that 'Florida Project' is the original name of Walt Disney World, which is, quite ironically, close to the cheap motel surrounding which the entirety of the movie takes place. The story follows 6-year old Moonne and her mother Halley, staying at The Magic Castle motel, in Kissimme, Florida. Moonne and her rag-tag bunch of friends have the time of their lives, waterballooning passing tourists,  rambling on about things only six year olds can fully comprehend and winding up some of the other dysfunctional tenants. But of course, Moonne has her ways around stuck up adults, as her relationship with the manager, Bobby (played by Willem Defoe) goes to show. Fair warning if you're expecting an A to B tangible plot, there isn't any. The Florida Project is as normal as normal gets in Florida's low-income niches. It is in the execution of its relatively simple plot that it shines, as the beautifully shot visuals and the stellar performance of the cast goes to show. The director Sean Baker does not gloss over or romanticise the struggle the people staying there face, instead choosing to show a very raw glimpse into these complicated lives bogged down by the city and the things they choose to enjoy. They live surrounded by cheap restaurants and abandoned apartment complexes, just specks on the road to the glamour of Disney World. On a side note, as surprising as it may sound, Willem Defoe does not play a neurotic, philosophising sociopath, but perhaps gives an even brilliant performance as Bobby, running the motel as an alcove of safety, protecting his tenants from whatever is outside, and yet still powerless to defend them against themselves.\nThe bond between Mooney and Halley is what makes this film as special as it is. The struggle that Halley has to go through, interacting with other adults to get what she and her daughter need, melts away when she's with Mooney, who shows a strange, often sad understanding of the adults around her. The movie projects these short moments of happiness they share, as it's argument for them living their lives as they do. The entire setup, especially the color pallet and the framing of the shots, forms sort of an antithesis of a Wes Anderson movie; what the Grand Budapest would've been like if it were a dingy motel for the homeless. Every now and then, we see shots of helicopters passing not far from the motel, and we see these people, whose lives are trapped, shifting from one room to the other, gleefully flipping them off and hurling insults, as the choppers fade away above the city. Frankly, there is no better way to describe The Florida Project. It is a group of misfortunate individuals defiantly searching for comfort amongst poverty, however broken and difficult that comfort may be. It is about the innocence of childhood, that provides a temporary refuge from the harshness of reality that is waiting outside the door. The Florida Project is, above all else, a vitally human film. Go give it a whirl."
    },
    {
      "reviewId": "r16",
      "movieName": "Moothon",
      "director": "Geetu Mohandas",
      "author": "Nandana Sony and Nandakishor M Pai",
      "year": 2019,
      "reviewText": "Moothon is a movie filled with contrasts and ironies. The film travels between a scenic Lakshwadeep and a gritty Bombay, ironically, symbolizing ignorance and acceptance respectfully. The island blanketed in lush blue tones, inhabited by people who speak the playful and lulling language of Jeseri but believe in extreme rituals involving self-harm, acts as a short-lived paradise for Akbar and Amir. The island, isolated from new concepts and realities requires the couple to hide their relationship thereby their sexualities. Then we come to Kamathipura in Bombay, lighted by raunchy red shades, where the language of the masses is a brutal, unsparing Hindi dialect, where the islanders travel to with dreams and hopes but mostly end up in squalor. Here, the contrasts couldn't be clearer as the characters sell their sexuality rather than hide it, for survival. As Akbar transforms from the wide-eyed boy dreaming of the city of Bombay unable to even hold a smoke, to a feared man in the very same city who seeks solace in drugs, what remains constant is that he carries the heavy tag of the elder brother wherever he goes. For Mulla, he is 'Moothon' and for the people of Kamathipura he is their 'Bhai' but ironically he never lives up to both of those titles as he never manages to protect those he loves.⁣\nThere are even certain scenes depicting magical realism in the movie, for example, Akbar seeing the flying fish and Mulla encountering the mysterious mermaid. We as an audience might dismiss these scenes as hallucinations as we remain ignorant towards possibilities, but for the characters, it's nothing but a real experience as they welcome whatever they encounter because they believe this will open a path that will bring them happiness.\nThe movie also tackles concepts of sexuality and gender identity. Amir's muteness indicates his hidden sexuality and Akbar is the only person on the island who truly understands his attempts at communication and thus his sexuality. Amir's face glows in the moonlight by the seaside as he has his first conversation with Akbar, perhaps this is how Akbar sees him, with an aura of luminescence. There are two scenes where two different characters(Akbar and Latheef) look at themselves in the mirror, both anticipating an encounter with somebody who they love or maybe in the latter case, lust after and this difference is apparent in their different interpretations. Then comes Mulla's friend who is a victim of love at (intrusive) first sight, which shows how flimsy the concept of gender is. He might have needed the validation that Mulla was a girl for him to allow himself to fall in love with her or maybe he accepts for what she/he identifies themselves to be. The open ending of the movie in which characters make bad decisions time after time requires the audience to make a decision. Does Mulla escape from her/his current complication and also does she accept her identity as a girl as arduously advised by Latheef or does she/he continue to cross-dress to get closer to Akbar maybe or does he identify as a boy? Frankly, the answer regarding the gender identity doesn't matter as the movie teaches us to look beyond labels and delve deeper into emotions."
    },
    {
      "reviewId": "r17",
      "movieName": "12 Angry Men",
      "director": "Henry Fonda",
      "author": "Nandakishor M Pai",
      "year": 1957,
      "reviewText": "\"Truth is not always True\"⁣\n12 angry men is a court room drama set in 1950's. A boy gets accused of killing his father and the judge is pretty much convinced about it and the 12 member jury is allowed to finalise their decision. I am not at all getting into story as it may unknowingly affect your watching experience. 96 minute long journey inside a room is captured brilliantly. I have always been a fan of thrillers that have some unique elements like in this, the story happens inside a room. By that the director is inviting us to join with them to be an active listener. 20 minutes into the film you will actually feel as if you are inside the room witnessing the discussion. ⁣\nThe 12 characters are well written and are so different from each other in their dialogue delivery, costume, postures and what not. The story never gets into the trap of one man show in terms of perfomance . The situation gets hot and it is metaphorically shown through the temperature rise in the room due to lack of Fans. Legal arguments heating up to personal conflicts is portrayed so organically that even you start picking sides. ⁣\nFor me the film was never about victory of truth or moral. For me it shows the power of convincing skills that can make difference in any situation possible. In an analysis i read that the lighting also symbolise the seriousness of the situation as the discussion starts at day and ends by night. ⁣\nThe film ends by reminding us the true meaning of \"Democracy\" that each opinion matters even though the odds are against and it is not necessary that the majority is always right. Even though the film was made 60-70 years ago, the message is still relevant and strong. Court room dramas try to convince us that \"Justice will be served\"."
    },
    {
      "reviewId": "r18",
      "movieName": "Trance",
      "director": "Anwar Rasheed",
      "author": "Abdullah Shaffi",
      "year": 2020,
      "reviewText": "\"I don't live in your reality\"\nAn outstanding first half followed by a bleak 2nd half, many of us have heard mixed reviews for trance. A 2nd half filled with so many loopholes. The whole character of Nazriya, viju's all wealth was sealed by government and with no one to ask help for, how did viju reach Amsterdam? From where did he get the money!⁣\nThe writer and director created a perfect first half, so what happened to the second half? What if the loopholes are put there in the second half deliberately! A first half full of realistic frames and lighting turned to fancy in the second half. Fahad almost becoming the superhero of the movie. ⁣⁣\nPastor JC calton died in the first half. In the third day he resurrects ( Jesus reference ). But he never woke up. He was always in coma during the second half. The events happened after the second half are viju's imagination. The villains soon after the incident hires a new pastor and the story moves on. But that is the original reality and the second half in the movie shows us the imagination of viju. Viju failed miserably in life. What will we do if we fail in life / face a difficult situation but we didn't have the strength to defend that. We ourselves envision us with superpowers and create a story in our mind in which all things happen in favour of us. And in that imagination everything is perfect. Some underdeveloped characters in the second half, Vinayakan and Nazriya, may be the dear ones which viju had lost in the past. Vinayakan a father who blindly believed in religion and lost his only daughter to death. It may be portrayal of viju's father. Viju in the first half clearly states that he is an atheist. The former could possibly be the reason for that. And in the last scene where Viju meets Nazriya, they never meet actually, the film ends with Nazriya running and screen fades to black and a glass breaking sound. This could possibly indicate the end of imagination.Most of them including me couldn't perceive this in the first watch of this film only beacuse, we stood in the shoes of typical malayalam films. ⁣\nTrance is a masterpiece that will stand out in the future for sure.\nTrance word meaning is \"half awake, half asleep\". Fahad is awake in the first half and sleeping in the next."
    },
    {
      "reviewId": "r19",
      "movieName": "Pink",
      "director": "Aniruddha Roy Chowdhury",
      "author": "Anjali Pillai",
      "year": 2016,
      "reviewText": "Surrounded by the weeping seven dwarves, Snowhite lay in the coffin dead.Then came her prince charming, who slowly bent down to kiss her, and behold; the dead Snow white is all life again. What a romantic story. But wait, did the prince ask for her consent before kissing? No,because it doesn't matter,it never matters!We grew up hearing such stories and seeing such films that the concept of consent never mattered. Everything was to be surrendered to the hyper masculine agendas. The hero follows the object of his desires. The heroine shouts at him to leave her alone. He grabs her arm. She pushes him off. He forces her into his arms. She struggles out of it. In some films, his group of friends join in on the harassment and entrap her further. Yet somehow after this de facto molestation, the film has found a way to make this abused woman fall in love with their hero, thus imparting the harmful false truth that \"NO\" doesn't really mean \"NO\". Instead, a woman's lack of interest is simply a challenge for a man to overcome. This is how films have buried deep down the idea of consent. There is this scene in DDLJ where Raj pranks Simran that they slept together while she was drunk. A cute funny scene. But more than being a funny it is only reaffirming the misconception that drunk women are open for sex. We grew up singing ‘Tu Haa Kar Ya naa kar..' from the movie Darr. That is, we grew up singing that ‘a woman’s opinion doesn't matter Bollywood songs have only objectified women and depicted them as a sex toy. Most of the songs are a testament to the existing masculinity that overpowers a woman's opinion. It is only after the release and success of the film Pink that people began questioning the existence of consent. The lawyer in the film advocates No means No, that is, when any woman, be it your friend, girlfriend, sex-worker or even your wife say No,Men must Stop. Pink sends a message, loud and clear on how we must consider the choices and opinions of ⁣women. Lack of consideration for consent only made restrictions on women tighter as it is easier to teach our girls how to prevent themselves from getting raped than it is to teach our boys not to rape."
    },
    {
      "reviewId": "r20",
      "movieName": "Jojo Rabbit",
      "director": "Taika Waititi",
      "author": "Nandakishor M Pai",
      "year": 2019,
      "reviewText": "Be the rabbit who hunts carrots for his family and country.\nOr\nBe the rabbit who survives from it's hunters.\nJojo Rabbit is a wisely made brilliant film that puts forth the courage to be political and appeal to the worldwide audience in a comedic tone that makes everyone laugh irrespective of whom they support and the smile ends in a thought regarding the bitter truth creatively hidden by the director for the audience to search and find. Taika waititi who directed and acted in jojo rabbit makes us realise that hitler is not just a person but a voice inside us that conflicts with our good voice. Jojo's imagination burns the fear we had for the hitler through his deeds in seconds of conversation between them. Not giving away any spoilers by appreciating each scene. Organically developed screen play portrays attacks,firings and other crucial scenes in a weird but adorable manner.\nThe boy who played the role of jojo, Roman Griffin has acted without showing the acting. Natural reactions to situations make us relate to his conflicts and questionable concepts that he is Carrying. I laughed,thought and at the end my eyes got a bit wet...maybe those were the tribute to humanity. Hat's off Taika waititi. 'Hail hitler hail Hitler' to 'go to hell hitler'"
    },
    {
      "reviewId": "r21",
      "movieName": "Little Women",
      "director": "Greta Gerwig",
      "author": "Lasitha Chandran",
      "year": 2019,
      "reviewText": "'Little women' is an exceptional movie that has taken the freedom of mixing up the chronology of events described in the book without distorting the order of chaos that these girls portray. Greta has done a clean job at that , and has made sure that the viewers have their eyes glued to the screen for each character unfolds hastily in a neat manner. The girls' and the mother's lives spent in the quaint little house , right from the Christmas morning gives a warm , fuzzy feeling despite their poverty. This story of the four March sisters is very amusing yet has a subtle moral to every plot and every character development of it.⁣\nEven though the sisters all have a very contrasting character, they all have one thing in common that they have got from their mother, her goodness. The girls , even though are brought up in poverty, they were always happy and never stopped sharing their happiness. It makes us realise that happiness can't be bought with money as also seen from the Lawrence household, where they are bloody rich but are poor when it comes to contentment . Jo , being my favourite character , is a true inspiration, for she showed what a great pain it takes to just wish to change the world at that time. The second younger sister,Beth's sickness drives the household into a turmoil . When she first gets hit by the fever Jo was always at her disposal. One morning when Jo couldn't find her, she comes down the stairs and finds her eating breakfast , the relief that Jo felt , I felt it. But the second time , the same thing happened , and Beth wasn't there , the pain that Jo felt , I felt it. This was a scene that sure touched many hearts. ⁣\nFlorence Pugh, definitely deserved the Academy Awards supporting actress nominee , for no one could have portrayed the development of a stubborn girl turning to a calm woman grown out with stature and beauty. As the girls turn women, life happened and they grew distant ,they faced the true hardships of life , learnt their lessons and yet when they meet, the distance is never a problem as their bond is as strong as it can ever be . This movie shows true meaning of strength that relationships bring in life.⁣"
    },
    {
      "reviewId": "r22",
      "movieName": "Frances Ha",
      "director": "Noah Baumbach",
      "author": "Lasitha Chandran",
      "year": 2012,
      "reviewText": "Frances Ha never gave out the vibes of a monochrome movie, which it was, because it portrayed so many colours of Frances. One of the highlights of this movie was that the main character was never removed from the spotlight. Greta Gerwig ,the lead actress and co-scripter of this movie plays the role of Frances Ha, an urban girl who is a dancer, trying terribly to make a living and fit in New York , infamous for its cost of living and expectations,as high as it's skyscrapers.\nThe starting of the movie reminds me of the summer season, fun filled, living to the fullest and trying new things with her best friend , Sophie. It's that period of friendship where both the parties feel like this is a forver rock solid relationship . Sophie continues to make growth in her life , with her job and relationship with her boyfriend. This is not approved by Frances whose life has been stagnant for quite a while now .One of the other elements of her was , she is a person who would like to get validation for everything she does.\nAfter which,her character struggles with people , her relationships ,her job and trying to maintain a roof over her head . Christmas came and so did she leave the concrete jungle to live with her parents and has a good time after a long time , taking a trip down her memory lane leaving her worries somewhere along the lanes of Brooklyn. When she comes back , she starting winding down into more problems.Late,her craze for escaping this misery leads her spending lonely long days at exquisitely beautiful Paris which later leaves her broke.\nThe end of the movie is quite satisfying, the struggles that Frances went through,happily and in her own way made her realise her own path and her desperation that lived with her almost throughout the film , has finally dissolved and she seems quite calm during the showcasing of her choreography. I feel that we all have 'Frances' in us, we all face the difficulties trying to fit in , trying to pretend some relations are more firmly based than they actually are. Hence, It's a movie that needs no narration with a character that needs no introduction."
    },
    {
      "reviewId": "r23",
      "movieName": "Moothon",
      "director": "Geetu Mohandas",
      "author": "Athul Neelaparambil",
      "year": 2019,
      "reviewText": "Moothon: The Daring Search\nHats off to Geetu Mohandas for this one big daring attempt in the Indian film industry. Because this journey of the kid to find his \"Moothon\" (big brother) goes deep into the existing culture and traditions in the country. One may agree or disagree with plot points in the story. But one thing is for sure, this Pan Indian film is worthy of being written as one of the well made films in the country. The story progresses as Mulla starts from Lakshadweep to find his big brother. As he reaches the city, the lone island kid could not stand the heat of the gullys. And that's where he meets Bhai. From then onwards, the story travels through the underworld of Mumbai, through the personal problems of the characters, the family relations, and the conscience of the society. Geetu Mohandas as a storyteller has shown a dark world, with glimmers of hope. The actor who has outdone himself. Nivin Pauly has gone way out of his comfort zone to be the Bhai. And this role is the answer to the criticisms he's been receiving these days. Absolutely incredible. In the hands of a director who won't settle for nothing but the best, the actor as well as all the actors, be it Roshan Mathew, Dileesh Pothan has given stellar performances. The frames of Rajeev Ravi, the beautiful Jasari language and the dark and brutal Hindi dialouges of Anurag Kashyap, and the culture of Lakshadweep sets a different atmosphere all together. It may not be everyone's cup of tea, but it is a film to be understood by the society."
    },
    {
      "reviewId": "r24",
      "movieName": "Joker",
      "director": "Todd Phillips",
      "author": "Pranav Prasad",
      "year": 2019,
      "reviewText": "\"All it takes is one bad day to reduce the sanest man alive to lunacy. That's how far the world is from where I am. Just one bad day\" - Joker⁣\nSet in the early 1980s of the Gotham city - Joker , directed by Todd philips is the origin story of one of the most chaotic and iconic DC villains.Throughout the decades the character has been portrayed by many actors in numerous ways and each actor brought something new to the villain.We have seen Jack Nicolson's Joker in Batman(1989) and the legendary dark portrayal of Joker by Heath Ledger. Heath Ledger's joker set a benchmark which everyone believed no one could ever touch it again. We've also seen one of the unsettling and forgettable portayal of joker by Jared Leto.⁣ Later on there had been a great buzz going on about the next Joker movie when it was known Todd philips Joker will be portrayed by Joaquin Phoenix. It's hype went real high when it received splendid responses at Venice Film Festival.⁣\nNow coming to the film, This movie is not your standard comic book affair.⁣\nThis film is bold, it's courageous,it's horrifying and it leaves us disturbed and that's exactly the feeling with which we want to walk out of the theatre after watching a Joker's Origin movie.⁣\nThis is one of my favourite DC films by far without a doubt and may be the best movie of the year.I couldn't say I loved it because that's not the only emotion with which you walk out of the theatre.⁣\nTalking about Joaquin Phoenix, well I can't really put it into words .He takes us to a much darker and alluring world like never before.One of the things that makes his portayal of Joker absolutely brilliant is the tragedy of his character and his slow but steady descent into madness in his physical level as well.⁣\nThe DC's supervillain is chaotic and he doesn't have a reason for doing what he does to the people of gotham city. But somewhere deep inside our minds we feel sorry for this character because that's how amazingly it has been scripted."
    }
  ]
}
