{
  "reviews": [
    {
      "reviewId": "r01",
      "movieName": "Cinema Paradiso",
      "director": "Giuseppe Tornatore",
      "year": 1988,
      "author": "Jacob Koshy",
      "reviewText": "\"Life isn't like in the movies. Life is much harder.\"\n'Cinema Paradiso', the movie which got stuck in my mind months before watching it. The image of a boy gazing at the theatre screen with enthusiasm, is still in my mind.\nThis movie is about the friendship between Salvatore and Alfredo. Salvatore is a famous film director, he returns to his hometown for the funeral of the local theatre's film projectionist Alfredo. The news of Alfredo's death takes him back to his memory of his life as a young boy falling in love with movies and how Alfredo had influenced him.\nThe first thing you'll miss after watching this movie will be the crowded theatres. Different people watching a movie in the same space. The feel, the ambiance, the cheering, the joy, The despair, all this can be experienced at its peak in the theatres. This was the first Italian movie that I watched,the feel this movie could give is not less than other movies. Movies influence people in many ways. Movies have the power to transport us from the time of prehistoric hunters and gatherers to futurestics space travellers. \nThe excitement in Toto's (Salvatore's) eyes reflects ourselves. Whether a movie is good or bad, it still has something which we can take with us. 'Cinema Paradiso' is a movie about life, love, friendship, moreover it's about MOVIES. Thank you Giuseppe Tornatore for giving this love letter to cinema. Unfortunately I haven't watched Tornatore's other movies so I can't explain his direction, techniques and all, but this movie should be his masterpiece. It can make us travel through the mind of Salvatore : make us happy when he is happy, make us sad when he is sad, In the end this is what a movie should do. Feeling connections towards the characters is what makes a movie memorable. Considering that, this movie could stay in your memories forever."
    },
    {
      "reviewId": "r02",
      "movieName": "CODA",
      "director": "Sian Heder",
      "author": "Hilan S Siva",
      "year": 2021,
      "reviewText": "CODA tells us the story of Ruby, who is the only hearing member of a deaf family, how she discovers her passion and pursues it. This movie is like a warm hug, which we all need at a certain point of our life. Ruby always felt inferior to the other children because of her family. Everyone in this movie had done their role perfectly, the one who stood out was Ruby's father (Troy Kotsur) but my favorite character was Ruby's brother, I could connect with that person at some point. And Ruby's choir teacher, how could I miss him. The movie is mostly told from the view of Ruby, that's why I told everyone as connected to her. But the screenplay is so good that it allows us to feel the emotions of every character who comes in this movie. This movie beautifully conveys the love shared by the members of the family, trying to be there for each other. I would say this movie is like a beautiful melody which could fill our hearts with happiness. Moreover I know how it feels to be the different member in the family, So for me it's the best feel good movie I had seen recently. Some movies have this magic with them, that they could remind us of a small thing........ That is who we are.....  HUMANS!\nI hope most of you may have watched this movie. If not, try to watch. Hope you'll like it.  "
    },
    {
      "reviewId": "r03",
      "movieName": "A Silent Voice",
      "director": "Naoko Yamada",
      "author": "Chris Godfrey",
      "year": 2016,
      "reviewText": "A Silent Voice\nA well known film that I believe should be a must-see for everyone not because it's beautiful but because it stresses on certain things about life that are very real in today's world. You may not like it but you can never hate it.\nThe movie begins with Shoya Ishida attempting to commit suicide over his actions during his childhood days before being confronted by his mother on the matter. Shouko Nishimiya, a classmate of Shoya during her childhood days, faced a disability of being unable to hear. Despite all of her attempts to become friends with him, he continues to bully her which eventually leads to her leaving the school. Shoya then slowly becomes ostracised from his group.\nLater on, Shoya meets her during high-school as a person who reflected on his actions. He believed his actions could not go unpunished. Despite that. Shoya decides to become friends with Shouko, learning to use the sign-language at the same time. The movie stresses on the fact that Shoya could not look at anyone's face with the \"x's\" in their faces as he could not forgive himself. Shouko was the kind of person who wanted to be amicable with everyone and would do anything. However, she believes it's her fault that things never go as planned and that she sees herself as being worthless, being a burden leading to repeated thoughts of dying.\nThe movie along with the soundtrack perfectly captures the moments as they forgive themselves and each other, and the focus on other characters becoming better versions of themselves. What I really liked was the many ways in which the movie tells us how to pay attention to each other's voices and to forgive oneself, to realize that everyone has a place in this world and that you are loved. The transformation of the character that was once a bully to a person who acknowledges what they've done and what they do to make up for it is what I believe makes for the beauty behind this film."
    },
    {
      "reviewId": "r04",
      "movieName": "Submarine",
      "director": "Richard Ayoade",
      "author": "Karthik Jayaram",
      "year": 2010,
      "reviewText": "To talk about the movie submarine is to talk about how refreshing your morning coffee tastes or the feeling you get when you are cozying up inside home with heavy rain pattering outside ur room, the silenced chucks of raindrops making your feel all safe inside ur tiny dwelling. Those tiny nuances of your emotions that you remember long after they have disappeared from your mind, the first hint of that long forgotten memory , that sums up to me the experience of submarine.\nBroadly speaking , submarine is a coming to age story of Oliver Tate, a rather confused adolescent , figuring and reasoning out his life experiences. A film style I have always loved , the self-narrative style, where the protagonist of the movie is the narrator itself, a very first person-ish feeling to a movie, a famous narrative trope that cult classcis such as Fight club (1998) also heavily incorporates.\nFrom enjoying being a lonely masquerade which apparently gives him time to think to monitoring his parents sexual patterns in order to save their marriage, Oliver shows us the things he has to do to give reasoning to his existence and everything around him. One very thought which Oliver goes deep into is  that , the only way he gets through life , is to imagine himself in an entirely disconnected reality. No, Oliver does not have an acid trip in the movie , but he explains how he often contemplates what would happen if he was suddenly dead. The funeral where his friends would tell that they missed him , his parents and teachers coming with hidden praises and sorrow everywhere. Oliver tate's death becomes an awakening for the people about the type of person he was, and people all around stand in regret , hoping to feel his energy for one last time. These deep internal imagiantions are a huge characteristic of the movie , the blissful day dreams that all of us fantasize about, not in the hope that they come true, but just as a way fo escape from the cold blooded logical nature of reality. \nThe first part of the movie deals with his love interest Jordana(an intimidating person acc. to Oliver)  and how he becomes her boyfried because of a series of events which involved in her blackmailing him. The rumours spread across the school and Oliver gets bullied , but stands up when the bully forces him to abuse Jordana , which piques her intrest in Oliver and they end up being in relationship. The following parts of the movie are shot in a way you would rememeber a relationship in the most nostlagic way possible.\nWith alex turner , the artic monkeys lead vocialist stepping in with his guitar poems, adding the teenage romantic aesthetic into the picture. The cinematography also is very unique, with the shots being similar to that shot in the  1980s ; with the color toned down and slightly  grainy and seems like it was shown straight out a film roll. The rather unusual bonding between two behavarioual extremes of Oliver and Jordana is a huge part of what makes the movie so beautiful, big old bully Jordana slightly but hesitantly showing her soft side to Oliver and him embracing those experiences slightly confused but still enjoying the moment nevertheless.\nThe mental adventures of Oliver Tate doesnt stop there. It seems he loves his family but details to us about the incompatibilities between his parents that he is afraid might split them apart. The second part of movie is about him  desperately trying to save his parents marriage by constantly monitoring his parents voicecalls a, routine checkup of his parents bedroom etc etc . The encounters following this in a way goes deeper into the personality of Oliver.\nThough the movie is primarily narrated by oliver , we get snippets at some parts of the movie which are left unexplained by him, a different angle with which the movie goes deeper into the character of Oliver. The movie ends in a final showdown  where Oliver has to make some serious life decisons as his relationship with Jordana enters new territory and hope of his paretns being happy together seems grimmer than ever.\nThe movie is set in a seaside town in Wales, Great Britian and the setting of the town adds a unique effect to the world building in the movie. The numerous hills in the periphery, the dull and gloomy mornings, the long sunsets ,the dark sky characteristic of that before rain ensues etcetc.; the weather perfect for sitting inside a home and drinking a hot cup of coffee.\nMost the the actors also perfectly execute the typical welsh accents first noticed in the way Oliver tate's class teacher speaks and also subsequently in the cuss rich sentences that his friends tell when advising him about his relationship.\nThe accents are not very much seen in Oliver and his family which hints at them not being from a Welsh setting but nothing in the movie gives evidence of that. Jordana also doesnt really have a deep accent but it is noticeable during a few conversations in the film later on.\nWhat captured my attention most is the constant feeling of serious triviality in the movie. The scenes may be something really silly or quite normal, but the whole setting of the frame , the music, the camera angle , the scenes all focus on the serious deep feeling that Oliver is going at that moment. In a  deeper sense it shows how although teenagers have pretty trivial problems compared to those of adults , the feeling that they go through is serious nevertheless.\nEven oliver seems to be aware of this at a few parts of the movie saying,\"these things that I'm doing right now might feel funny while my 38\" .\nThe music by Alex Turner is probably the reason why i loved the movie in the first place. I had heard the Submarine album a year before watching the movie and the songs Piledriver waltz and stuck in the puzzle still remain close to my musical being. That emotional setting provided by the songs help me vibe with the movie at first watch itself and I have at times contemplated whether i would have even liked the movie in the first place if I hadnt listended to those songs before.\n In summary it might seem like a cliche  rom-com  where a boy lands a girl and he saves his parents marriage and everything ends happily . But to me , the film is more than that. Its shows me how beatiful of an experience growing up is, realizing that those tiny emotions that are part of maturing up and being part of some pretty questionable stuff , the kinda stuff u remember when ur 38.\nTo me it shows how life is an experience in itself, no talents , no big events nothing.\nThe simple act of living and experiencing those nuances of life has a bigger meaning to it, because those are the  things that decorate our life till we part with the world and we should cherish them always."
    }
  ]
}
